---
kind: method
id: M:Autodesk.Revit.DB.LevelAssociationData.Dispose
source: html/a0838448-5698-48f0-eda3-628e00405524.htm
---
# Autodesk.Revit.DB.LevelAssociationData.Dispose Method

Releases all resources used by the LevelAssociationData

## Syntax (C#)
```csharp
public void Dispose()
```